<?php $this->setLayoutVar('title', 'Terms Of Service') ?>
<?php $this->setLayoutVar('back_link', "/login") ?>
<link rel="stylesheet" href="<?php echo $base_url;?>/css/termsOfService.css" type="text/css" media="screen" />

<form action="<?php echo $base_url; ?>/termsOfService" method="post">
    <!--コンテンツ-->
    <div id="contents">
        <!--スクロール部分-->
        <div class="reading">
            <p>
            SHARKサービス利用規約（以下「本規約」といいます）は、SHARK, Inc.が提供するアプリケーションソフトウェア「SHARK」を利用するにあたって適用されるものであり、利用者は本サービスを利用した時点で本規約に同意したものとします。
            </p>

            <br>

            <h4>第1条　定義</h4>
            <p>
            「弊社」：SHARK,Inc.
            「本サービス」：アプリケーションソフトウェア「SHARK」、「SHARK」ウェブサイト、または「SHARK」を通じて提供されるサービスすべて
            「利用者」：本サービスを利用するすべての方（登録希望者を含み、また、アプリケーションソフトウェアの使用、ウェブサイトの閲覧等による利用を含みます）
            「ユーザー」：本サービスの利用登録を行った方
            「登録情報」：本サービスの利用登録のために、ユーザーが提供した情報
            「コンテンツ」：本サービスを利用するにあたってユーザーがアップロードしたテキスト、音声、その他一切の情報
            </p>

            <br>

            <h4>第2条　本規約の範囲</h4>
            <p>本規約は弊社が提供する本サービスの利用に関して適用されます。</p>

            <br>

            <h4>第3条　本規約の変更</h4>
            <p>
            本規約は弊社の判断により、いつでも任意の理由で変更することができるものとします。
            変更後の本規約は、弊社が別途定める場合を除いて、本サービスにて変更後の本規約を公開した時点より効力を生じるものとします。
            ユーザーが本規約の変更の効力が生じた後に本サービスを利用した場合には、変更後の本規約のすべての記載内容に同意したものとみなされます。
            </p>

            <br>

            <h4>第4条　個人情報の取り扱い</h4>
            <p>弊社はユーザーの個人情報を「プライバシーポリシー」に基づき、適切に取り扱うものとします。</p>

            <br>

            <h4>第5条　登録</h4>
            <p>
            本サービスの利用を希望するもの（以下「登録希望者」といいます）は、本規約を尊守することに同意した上で、本サービスの利用登録の申込を行うことができます。
            登録希望者は、弊社が登録希望者からの登録の申込を承諾した時点でユーザーとなります。
            弊社は第1項に基づき登録の申込をした者が、以下のいずれかの事由に該当する場合、登録を拒否することができるものとし、ユーザーは予めこれを了承するものとします。
            登録情報の全部または一部に虚偽があった場合
            登録希望者が過去に本規約に違反したとして強制退会処分を受けたことがある場合
            その他弊社が不適切と判断した場合
            </p>

            <br>

            <h4>第6条　ユーザー登録情報の変更と管理</h4>
            <p>
            ユーザーは自己の責任によって、メールアドレスおよびパスワードの使用および管理を行うものとします。
            ユーザーは本サービスに登録したメールアドレスおよびパスワードを第三者に開示、利用、貸与、譲渡、売買することはできないものとします。
            ユーザーは本サービスへの登録内容に変更があった場合、速やかに本サービス所定の方法で変更の手続きを行うものとします。変更の手続きがないことでユーザーが不利益を被ったとしても、弊社は一切の責任を負いません。
            ユーザーによるメールアドレスおよびパスワードの管理不十分から生じた損害等につきましては、弊社は一切の責任を負いません。
            </p>

            <br>

            <h4>第7条　ユーザーの責任</h4>
            <p>
            ユーザーは、ユーザー自身の自己責任において本サービスを利用するものとし、本サービスの利用においてのすべての行為とその結果について、一切の責任を負います。
            本サービスを利用してユーザーが投稿したコンテンツに関する責任は、すべてユーザー自身にあります。弊社はユーザーがコンテンツについて、一切の責任を負いません。
            ユーザーが著作権法に違反する行為を行った場合、プライバシー権を侵害した場合、そのほか他人の権利を侵害した場合には、当該ユーザーは自身の責任と費用においてこれを解決するものとし、弊社は一切の責任を負いません。
            </p>

            <br>

            <h4>第8条　退会</h4>
            <p>
            ユーザーは弊社が定める方法により、いつでも本サービスを退会することができるものとします。なお、ユーザーは、退会に伴い、本サービスにおけるユーザーとしての一切の権利を失うものとします。
            弊社は、ユーザーが以下のいずれかの事由に該当するまたはその恐れがある場合、ユーザーへ事前に通告・催告することなく、かつ、ユーザーの許諾を得ずに、弊社の裁量によりただちに当該ユーザーを退会させることができるものとします。
            本規約に違反した場合
            登録情報の全部または一部に虚偽または過誤がある場合
            その他弊社が不適切と判断した場合
            </p>

            <br>

            <h4>第9条　禁止事項</h4>
            <p>
            本サービスのご利用において、以下の行為を禁止します。
            弊社の運営を妨害する行為
            他のユーザーの利用を妨害する行為
            他人の名誉、社会的信用、プライバシー、肖像権、パブリシティ権、著作権その他の知的財産権、その他の権利を害する行為
            他人への中傷、脅迫、いやがらせに該当する行為
            法令や条例に違反する行為
            公序良俗に違反する、または違反する恐れのある行為
            犯罪行為または犯罪に結びつくもしくは助長する行為
            性交およびわいせつな行為を目的とした出会い等を誘導する行為
            弊社の承認がないにも関わらず、本サービスを利用して営利を目的とする行為
            本サービスの信用を損なう、または損なう恐れのある行為
            本サービスの運営に支障を与える、または与える恐れのある行為
            その他、弊社が不適切と判断する行為
            </p>

            <h4>第10条　コンテンツの削除および公開停止</h4>
            <p>
            弊社はユーザーがアップロードしたコンテンツが本規約第9条に違反しているまたはその恐れがある場合、ユーザーへ事前に通告・催告することなく、かつ、ユーザーの許諾を得ずに弊社の裁量により当該コンテンツの一部または全部を削除または公開停止することができます。
            本規約第9条違反となる事由またはその恐れがある事由が解消されたか否かの判断は、弊社に一任されるものとします。
            ユーザーは、弊社の削除また公開停止措置に対して、何ら異議を述べないものとします。またユーザーは、削除または公開停止措置により受けた一切の損害について、弊社に損害賠償請求その他理由の如何を問わず何らの請求も行わないことに同意するものとします。
            コンテンツ権利者から申し立てがあった場合、弊社の判断により、コンテンツの違法性・利用規約違反の有無に関わらず、コンテンツの削除または公開範囲の変更等を行うことができるものとします。
            </p>

            <br>

            <h4>第11条　本サービスの停止等</h4>
            <p>
            弊社は以下のいずれかに該当する場合には、ユーザーに事前通知することなく、本サービスの利用の一部または全部を中断または停止することができるものとします。
            本サービスに関わるシステムの点検または保守作業を定期的または緊急に行う場合
            本サービスに関わるシステムが事故により停止した場合
            火災、地震、停電、洪水、津波等の天災地変により本サービスの運営ができなくなった場合
            その他、弊社が本サービスの中断または停止が必要と判断した場合
            </p>

            <br>

            <h4>第12条　所有権と知的財産権</h4>
            <p>
            ユーザーは、本規約で定める使用範囲を超えて、使用してはならないものとします（弊社の承諾なく本サービスを利用して営利行為・商用目的での使用を行うことを含みます）。
            本サービスにより提供されている機能やサイト上のある本サービス情報の著作権、特許権、商標、意匠権等の知的財産権は、すべて弊社に帰属するものとし、利用者はその一切の知的財産権を侵害する行為をしないものとします。
            ユーザーのコンテンツに関する著作権は、すべてユーザーに帰属するものとします。
            弊社はユーザーがアップロードしたコンテンツを、本サービスの提供、利用促進および本サービスの広告・宣伝目的で公に発表する権利を持つものとし、ユーザーは弊社が本サービス上およびサイト上において、ユーザーがアップロードしたコンテンツを、無償かつ非独占的に使用できる権利を許諾するものとします。また、弊社は、同様の権利を弊社が指定する第三者に対して、再許諾できるものとします。この場合、ユーザーは、弊社および弊社から許諾を受けた第三者に対し、一切の著作者人格権、知的財産権、およびその他の権利を行使しないものとします。
            ユーザーが保有するコンテンツを、ユーザーが指定する第三者に譲渡した場合、第三者は本規約に同意したものとみなします。なお、第三者が本規約に同意しない場合、弊社は譲渡を認めないものとします。
            提供楽曲およびコンテンツの権利は、弊社または権利を有する第三者に帰属します。
            </p>

            <br>

            <h4>第13条　Mix機能について</h4>
            <p>
            本サービスには、ユーザーがアップロードしたコンテンツに、別のユーザーがコンテンツを重ね、加工してアップロードできる（利用できる）「Mix機能」が実装されています。ユーザーは、「Mix機能」において本サービスの別のユーザーがユーザーのアップロードしたコンテンツを利用することをここに許諾するとともに、かかるコンテンツ利用につき、著作者人格権、知的財産権、その他一切の権利を行使しないものとします。
            加工後のコンテンツは、加工を行ったユーザーに帰属しますが、加工前のコンテンツの著作権者は、加工後のコンテンツについて二次的著作物の原著作物の著作者の権利（著作権法第28条）を保有します。また、別のユーザーによる加工行為は、加工前のコンテンツの著作権その他一切の権利に何ら影響を及ぼしません。
            ユーザーが本サービスの範囲内での使用を超えて、加工後のコンテンツを使用した場合、その結果については当社は一切の責任を負いません。
            ユーザーは加工後のコンテンツを、弊社が利用促進および本サービスの広告・宣伝目的のために公に発表する権利を許諾するものとし、また弊社が本サービスにおいて、無償かつ非独占的に使用できる権利を許諾するものとします。また同様の権利を弊社が指定する第三者に対して、再許諾できるものとします。この場合、ユーザーは、弊社および弊社から許諾を受けた第三者に対し、一切の著作者人格権、知的財産権、およびその他の権利を行使しないものとします。
            Mix機能を利用してコンテンツを加工する場合、加工前コンテンツの著作権者または実演家の名誉を毀損するような加工、その他著作権者または実演家の権利を侵害するような加工等は禁止します。かかる加工が行われたまたは行われる恐れがある場合、弊社は、ユーザーへ事前に通告・催告することなく、かつ、ユーザーの許諾を得ずに弊社の裁量により当該コンテンツの一部または全部を削除または公開停止することができるものとします。
            コンテンツのMixが起因で問題が発生した場合、弊社は一切責任を負わないものとします。Mixはユーザー自身の責任で行うものとし、万が一他のユーザーとの間に紛争が生じた場合には、弊社はこれに何ら関与することは致しません。この場合、当該ユーザー同士で、当該紛争を解決するものとします。
            </p>

            <br>

            <h4>第14条　利用料金</h4>
            <p>登録および基本サービスは無料とします。</p>

            <br>

            <h4>第15条　免責事項</h4>
            <p>
            弊社は本サービスで提供されるコンテンツその他の情報の完全性、正確性、適用性、有用性、第三者権利侵害の有無のいずれについても保証するものではありません。ユーザーは自己の責任と判断で、本サービスで提供されるコンテンツを利用するものとします。
            弊社は本サービスの内容および利用により生じたユーザーの損害（第三者との間で生じた紛争等に起因する損害も含みます）および本サービスを利用できなかったことにより生じたユーザーまたは第三者の損害につき、一切の責任を負いません。
            弊社は本サービスの確実な提供、アクセス結果、セキュリティ等の品質についても、一切保証しません。第11条1項により本サービスが一時的に停止した場合も含め、本サービスの欠陥が原因でユーザーまたは第三者に損失や障害が発生した場合であっても、一切責任を負いません。
            弊社はコンテンツを監視したり、保存する義務を負いません。
            ユーザーが本サービス上各種情報を掲載する場合、すべて自己の責任で行うものとし、何らかのクレーム請求その他トラブルが生じた場合にはユーザー自らが解決し、弊社は一切免責されるものとします。
            弊社は本サービス提供のためのコンピューターシステムの障害等による電子メールの遅配、未配、およびそれ以外のいかなる原因に基づき生じた損害について、賠償する義務を一切負わないものとします。
            弊社は、本サービスおよび第三者のウェブサイトからのダウンロードやコンピューターウイルス感染などにより発生した、コンピュータ、回線、ソフトウェア等の損害について、賠償する義務を一切背負わないものとします。
            弊社はユーザーに対して事前通告なく本サービスの内容、名称、仕様等を変更する場合があります。これらの変更により生じたユーザーまたは第三者に発生した損害については、一切の責任を負いません。
            本サービスからリンクされている外部のサイトは、弊社が管理するものではありません。従って弊社は、弊社の管理外にあるリンク先のすべての情報の確実性、正確性、安全性、有用性、適合性および第三者権利侵害の有無について、一切の責任を負いません。
            ユーザーまたは利用者は、本条各項の事由によりユーザーまたは利用者に損害が発生した場合には、弊社に対して損害賠償請求を一切請求しないことを承諾するものとします。
            </p>

            <br>
            <h4>第16条　損害賠償請求額の制限</h4>
            <p>本サービスの利用に関し、弊社がユーザーまたは利用者に対して損害賠償責任を負担することとなった場合であっても、弊社の損害賠償の範囲は請求の原因の如何を問わず、現実に生じた通常かつ直接の損害に限定されるものとし、ユーザーまたは利用者の逸失利益、間接損害または特別損害については一切責任を負わないものとします。
            </p>

            <br>

            <h4>第17条　弊社からの賠償請求等</h4>
            <p>
            弊社はユーザーまたは利用者が本規約に違反したことにより弊社に損害を与えた場合には、当該ユーザーまたは利用者に対し、弊社に生じた損害および費用（弁護士費用を含みます）を請求できるものとします。
            弊社はユーザーまたは利用者が第9条に違反した場合、当該ユーザーまたは利用者の利用行為等を著作権法その他の法令に基づいて差止める権利を有するものとします。
            </p>

            <br>

            <h4>第18条　分離可能性</h4>
            <p>
            万が一、本規約に定める条項の一部が無効とされた場合であっても、他の条項の有効性に影響を与えないものとします。この場合当該無効とされた条項は、当初に意図された目的が可能な限り達成できる有効な条項に当然に置き換えられるものとし、ユーザーはこれをあらかじめ承諾するものとします。
            </p>

            <br>

            <h4>第19条　準拠法および管轄</h4>
            <p>本規約の準拠法は、日本法とし、東京地方裁判所を第1審の専属的合意管轄裁判所とします。</p>
        </div>
        <!--同意ボタン-->
        <div id="yes">
            <paper-button raised class="colored_white" id="submit">同意する</paper-button>
        </div>
    </div>
</form>

<script>
//画像を正方形に生成し、submitする
$(function($) {
    $('#submit').on('click', function(evt) {
        evt.preventDefault();
        setTimeout(function(){
            location.href = BASE_URL+"/add";
        },250);
    });
});
</script>